0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     "disc(Front|Side|Back)" 
    {
        type	        zeroGradient;
    }

    "(front|back)CounterPlate" 
    {
        type	        zeroGradient;
    }

    stationaryShaft  
    {
        type	        zeroGradient;
    } 

    shaftRotational  
    {
        type	        zeroGradient;
    } 
 
    sideWall
    {
        type	        zeroGradient;
    } 

    "(top|right)Port"
    {
        type	        zeroGradient;
    } 
    
    leftPort
    {
        type            zeroGradient;
    }

    bottomPort
    {
	type		fixedValue;
	value		$internalField;
    }

   
}

// ************************************************************************* //
